CaseUwithoutWallFunction/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "ABLConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE0;

boundaryField
{

    inlet
    {
        type            atmBoundaryLayerInletK;
	Uref            $Uref;
	Zref            $Zref;
	zDir            $zDir;
	flowDir         $flowDir;
	z0              uniform $z0;
	zGround         uniform $zGround;
	value		$internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE0;
        value           $internalField;
    }

    bottom
    {
	// Implementation for wall function
        // type            kqRWallFunction;
        // value           uniform 0.0;

	// Implementation without wall function where yPlus ~ 1
        type            fixedValue;
        value           uniform 0.0;
    }

    top
    {
        type 		zeroGradient;
    }

    front
    {
        type 		cyclic;
	neighbourPatch 	back;
    }

    back
    {
        type 		cyclic;
	neighbourPatch 	front;
    }
}


// ************************************************************************* //
