CaseUwithoutWallFunction/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include 	"ABLConditions"

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type 		zeroGradient;  
    }

    outlet
    {
        type 		zeroGradient;  
    }

    bottom
    {
	// Implementation for wall function
        // type            nutkAtmRoughWallFunction;
        // z0              uniform $z0;
        // value           uniform 0.0;

	// Implementation without wall function where yPlus ~ 1
        type            zeroGradient;
    }

    top
    {
        type 		zeroGradient;
    }

    front
    {
        type 		cyclic;
	neighbourPatch 	back;
    }

    back
    {
        type 		cyclic;
	neighbourPatch 	front;
    }
}


// ************************************************************************* //
